In [2]:
import pandas as pd
import numpy as np

In [ ]:
pandas.DataFrame.replace

DataFrame.replace
(
    to_replace=None,
    value=<no_default>,
    inplace=False,
    limit=None,
    regex=False,
    method= {'pad', 'ffill', 'bfill'}
)

Replace values given in to_replace with value.

to_replace : str, regex, list, dict, Series, int, float, or None
numeric, str or regex:
list of str, regex, or numeric:
dict
        to_replace = {'Pattern1':'replace1','Pattern2':'replace2'}
        to_replace = {'Column1':'Pattern','Column2':'Pattern'} , value='replacement'
        to_replace = {'Column': {'Pattern': 'Replacement' }} 

value:
    scalar, dict, list, str, regex, default None
    Value to replace any values matching to_replace with. For a DataFrame a dict of values can be used to specify which value to use for each column (columns not in the dict will not be filled).
    Regular expressions, strings and lists or dicts of such objects are also allowed.

inplace: bool, default False
    If True, performs operation inplace and returns None.

limit: int, default None
    Maximum size gap to forward or backward fill.

regex: bool or same types as to_replace, default False
    Whether to interpret to_replace and/or value as regular expressions.
    Alternatively, this could be a regular expression or a list, dict, or array of regular expressions in which case to_replace must be None.

method{'pad', 'ffill', 'bfill'}
    The method to use when for replacement, when to_replace is a scalar, list or tuple and value is None.

In [44]:
#Scalar `to_replace` and `value`
s = pd.Series([1, 2, 3, 4, 5])
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [45]:
s.replace(1, 5)

0    5
1    2
2    3
3    4
4    5
dtype: int64

In [46]:
s.replace([1, 2], method='bfill')

C:\Users\samsh\AppData\Local\Temp\ipykernel_32424\1140877935.py:1: FutureWarning: The 'method' keyword in Series.replace is deprecated and will be removed in a future version.
  s.replace([1, 2], method='bfill')

0    3
1    3
2    3
3    4
4    5
dtype: int64

In [50]:
s = pd.Series([10, 'a', 'a', 'b', 'a'])
s

0    10
1     a
2     a
3     b
4     a
dtype: object

In [64]:
#both are same
s.replace({'a': None})
#s.replace(to_replace={'a': None}, value=None, method=None)

0      10
1    None
2    None
3       b
4    None
dtype: object

In [63]:
#s.replace('a', method='ffill')
#s.replace('a', method='bfill')
#s.replace('a', method='pad')
s.replace('a')

C:\Users\samsh\AppData\Local\Temp\ipykernel_32424\88763741.py:4: FutureWarning: Series.replace without 'value' and with non-dict-like 'to_replace' is deprecated and will raise in a future version. Explicitly specify the new values instead.
  s.replace('a')

0    10
1    10
2    10
3     b
4     b
dtype: object

In [65]:
df = pd.DataFrame({'A': [0, 1, 2, 3, 4],
                   'B': [5, 6, 7, 8, 9],
                   'C': ['a', 'b', 'c', 'd', 'e']})
df

   A  B  C
0  0  5  a
1  1  6  b
2  2  7  c
3  3  8  d
4  4  9  e

In [77]:
#Scalar `to_replace` and `value`
df.replace(0, 5)         #same as df.replace(to_replace='str1', value='str2')  [df.replace(to_replace=0, value=5)]

   A  B  C
0  5  5  a
1  1  6  b
2  2  7  c
3  3  8  d
4  4  9  e

In [78]:
#List-like `to_replace`
List1 = [0, 1, 2, 3]
List2 = [4, 3, 2, 1]
df.replace(List1, 4)     #same as df.replace(to_replace=List1, value='str')    [df.replace(to_replace=List1, value=4)]
df.replace(List1,List2 ) #same as df.replace(to_replace=List1, value=List2 )   [df.replace(to_replace=List1, value=List2)]

   A  B  C
0  4  5  a
1  3  6  b
2  2  7  c
3  1  8  d
4  4  9  e

In [82]:
#dict-like `to_replace`
df.replace({0: 10, 1: 100})          # 0 with 10 , 1 with 100
df.replace({'A': 0, 'B': 5}, 100)    # Look 0 in Column-A and Replace both with 100 .Look 5 in Column-B and Replace both with 100. 
df.replace({'A': {0: 100, 4: 400}})  # Look 0 in Column-A and Replace both with 100 .Look 4 in Column-A and Replace both with 400

     A  B  C
0  100  5  a
1    1  6  b
2    2  7  c
3    3  8  d
4  400  9  e

In [105]:
#Regular expression `to_replace`
df = pd.DataFrame({'A': ['bat', 'foo', 'bait'],'B': ['abc', 'bar', 'xyz']})
df

      A    B
0   bat  abc
1   foo  bar
2  bait  xyz

In [107]:
df.replace(to_replace=r'^ba.$', value='new', regex=True) #Look Entire DataFrame
df.replace({'A': r'^ba.$'}, {'A': 'new'}, regex=True)    #Look for pattern r'^ba.$ only in Column-A and replace with new
df.replace(regex=r'^ba.$', value='new')                  #Look for r'^ba.$ in DataFrame and replace with new
df.replace(regex={r'^ba.$': 'new', 'foo': 'xyz'})        #Look for r'^ba.$ in entire DataFrame and replace with new.  Look for foo in entire DataFrame and replace with xyz. 
df.replace(regex=[r'^ba.$', 'foo'], value='new')         #Look for r'^ba.$ and foo in DataFrame. Replace them with new

      A    B
0   new  abc
1   foo  new
2  bait  xyz